app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories" WHERE (originplace = 'Hacker News')
SELECT "stories".* FROM "stories"
---
  def index

    @y_stories = Story.where("originplace = 'Hacker News'")
    @r_stories = Story.where("originplace = 'Reddit Webdev'")
    @t_stories = Story.where("originplace = 'Techmeme'")
    iterator_one = 0
    iterator_two = 0
    @stories = []
    while @y_stories.length > iterator_two && @r_stories.length > iterator_two && @t_stories.length > iterator_two